Revit 2026 API

# PushButtonData Class

---

This class contains information necessary to construct a push button in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPushButtonData Autodesk.Revit.UIToggleButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PushButtonData : ButtonData
```
```vb
Public Class PushButtonData
	Inherits ButtonData
```
```cpp
public ref class PushButtonData : public ButtonData
```
```fsharp
type PushButtonData =
    class
        inherit ButtonData
    end
```

The PushButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PushButtonData | Constructs a new instance of PushButtonData. |

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyName | The assembly path of the button. |
|  | AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button. |
|  | ClassName | The name of the class containing the implementation for the command. |
|  | Image | The image of the button.(Inherited from ButtonData) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from ItemData) |
|  | LargeImage | The large image of the button.(Inherited from ButtonData) |
|  | LongDescription | Long description of the command tooltip (Inherited from RibbonItemData) |
|  | Name | The internal name of the item. (Inherited from ItemData) |
|  | Text | The user-visible text of the button.(Inherited from ButtonData) |
|  | ToolTip | The tooltip of item. (Inherited from ItemData) |
|  | ToolTipImage | The image to show as a part of the button extended tooltip (Inherited from RibbonItemData) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | (Inherited from ItemData) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetContextualHelp | Gets the contextual help bound with this control.(Inherited from RibbonItemData) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button data.(Inherited from RibbonItemData) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.UI Namespace